forum_demo/app/controllers/borads_controller.rb

  def index
    @borads = Borad.all
---
SELECT "borads".* FROM "borads"

  def show
    @borad = Borad.find(params[:id])
---
SELECT "borads".* FROM "borads" WHERE "borads"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @borad = Borad.new(params[:borad])

    respond_to do |format|
      if @borad.save
---
INSERT INTO "borads" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 17 Oct 2012 02:12:54 UTC +00:00], ["name", "nihao`"], ["updated_at", Wed, 17 Oct 2012 02:12:54 UTC +00:00]]